<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[slashsec Insights ]]></title><description><![CDATA[Aktuelle IT Security Insights zum Thema Red Teaming und Penetration Testing]]></description><link>https://www.slashsec.at/insights/</link><image><url>https://www.slashsec.at/insights/favicon.png</url><title>slashsec Insights </title><link>https://www.slashsec.at/insights/</link></image><generator>Ghost 4.6</generator><lastBuildDate>Fri, 18 Jun 2021 07:16:22 GMT</lastBuildDate><atom:link href="https://www.slashsec.at/insights/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Kritische Konfigurations-Schwachstellen am Beispiel von eBay]]></title><description><![CDATA[<p>Schwachstellen mit hoher Kritikalit&#xE4;t m&#xFC;ssen nicht immer komplex oder auf veraltete Software zur&#xFC;ckzuf&#xFC;hren sein, im Gegenteil. Oft k&#xF6;nnen banale Konfigurationsfehler, welche f&#xFC;r Angreifer einfach zu identifizieren sind, gro&#xDF;e Auswirkungen auf das betroffene Unternehmen haben. </p><p>Ich will</p>]]></description><link>https://www.slashsec.at/insights/ebay-source-code-leak/</link><guid isPermaLink="false">60cc3f40707bbf490b07a9f8</guid><category><![CDATA[Bug Bounty]]></category><category><![CDATA[Vulnerability]]></category><category><![CDATA[git]]></category><dc:creator><![CDATA[David Wind]]></dc:creator><pubDate>Wed, 02 Jun 2021 11:07:20 GMT</pubDate><content:encoded><![CDATA[<p>Schwachstellen mit hoher Kritikalit&#xE4;t m&#xFC;ssen nicht immer komplex oder auf veraltete Software zur&#xFC;ckzuf&#xFC;hren sein, im Gegenteil. Oft k&#xF6;nnen banale Konfigurationsfehler, welche f&#xFC;r Angreifer einfach zu identifizieren sind, gro&#xDF;e Auswirkungen auf das betroffene Unternehmen haben. </p><p>Ich will dies an einem Beispiel erl&#xE4;utern und zwar anhand einer Schwachstelle, welche ich im November 2018 bei<strong> eBay Japan</strong> identifizieren konnte.<br>Den vollen Beitrag dazu (auf Englisch) finden Sie auf meinem privaten <a href="https://slashcrypto.org/2018/11/28/eBay-source-code-leak/">Blog</a>.</p><h3 id="hacking-ebay-japan">Hacking eBay Japan</h3><p>Im Zuge eines privaten Research Projektes suchte ich zu diesem Zeitpunkt nach falsch konfigurierten Git Instanzen, welche es anonymen Angreifern erlauben, sensible Daten wie Source Code herunterzuladen. <br>Ich stie&#xDF; schnell auf einen sehr bekannten Firmennamen: <strong>eBay</strong>. </p><p>Die Verwundbarkeit des Systems lie&#xDF; sich pr&#xFC;fen, indem die URL <a href="https://www.ebay.co.jp/.git/HEAD">www.ebay.co.jp/.git/HEAD</a> aufgerufen wurde und folgende Antwort retourniert wurde: </p><figure class="kg-card kg-image-card"><img src="https://www.slashsec.at/insights/content/images/2021/06/image.png" class="kg-image" alt loading="lazy" width="783" height="273" srcset="https://www.slashsec.at/insights/content/images/size/w600/2021/06/image.png 600w, https://www.slashsec.at/insights/content/images/2021/06/image.png 783w" sizes="(min-width: 720px) 720px"></figure><p>Dies ist ein starker Indikator, dass Angreifer &#xFC;ber das Internet ohne jegliche Anmeldung sensible Daten von den Servern von eBay herunterladen k&#xF6;nnen. </p><p>Ich wusste, dass eBay ein sogenanntes &quot;Bug Bounty Programm&quot; betreibt, weswegen ich die Schwachstelle auch weiter ausnutzte und versuchte, so viele Daten wie nur irgendwie m&#xF6;glich von den Servern herunterzuladen. </p><p>Einige Stunden sp&#xE4;ter war ich im Besitz von <strong>1,2GB an Daten</strong> mit <strong>Klartextpassw&#xF6;rtern</strong>, <strong>PHP Source Code</strong>, <strong>Konfigurationsdateien</strong> und mehr.</p><p>Ich habe diesen Umstand selbstverst&#xE4;ndlich sofort an eBay gemeldet und 16 Stunden sp&#xE4;ter war die Schwachstelle auch schon behoben. </p><h3 id="schlussfolgerung">Schlussfolgerung</h3><p>Anhand dieses Beispiels kann man erkennen, dass es oft nur einen kleinen Fehler (in diesem Fall eine falsche Berechtigung auf einen Ordner) braucht, um potenziell eine schwerwiegende Schwachstelle zu kreieren.</p><p>Schwachstellen entstehen sehr oft aufgrund von nicht aktueller Software, jedoch sollten Konfigurationen regelm&#xE4;&#xDF;ig gepr&#xFC;ft und Best Practices regelm&#xE4;&#xDF;ig geschult werden.</p><p></p><p></p><p></p><p></p>]]></content:encoded></item></channel></rss>